import q1 from '../Images/Capture.PNG'
import q2 from '../Images/Capture1.PNG'
import q3 from '../Images/Capture3.PNG'


export const questions = {
    qa: [{
        title: 'איזה בדיקה לא תעשה על אפליקצית וויז',
        answer: 3,
        options: ['מאתר כתובת קרובה', 'מתריע בפני חסימות בכביש', 'מודיע שאין קליטה', 'יודע לשמור תמונה']
    },
    {
        title: 'מה לא תבדוק בארון קיר?',
        answer: 3,
        options: ['שהוא יציב', 'שהדלתות שלו נפתחות בקלות', 'שהוא מכיל את הנפח שאמור להכיל', 'שקל להעביר אותו ממקום למקום ']
    },
    {
        title: 'מה התכונה הכי חשובה של אפליקצית וואטסאפ',
        answer: 2,
        options: ['שליחת תמונה', 'פתיחת קבוצה', 'שליחת הודעות', 'התנתקות מהמערכת']
    },
    {
        title: 'מה זה באג?',
        answer: 0,
        options: ['מצפים לפעולה ובפועל קורה משהו אחר', 'הודעת שגיאה', 'אתחול של המכשיר למצבו המקורי', 'יכולת נוספת של המכשיר לביצוע מטלות חכמות']
    },
    {
        title: 'מה תפקיד הבודק בחברה?',
        answer: 2,
        options: ['תמיכה למחשב', 'פיתוח מוצר מאפס', 'איתור תקלות', 'הטמעת מערכות']
    },
    {
        title: 'מה ההבדל בין אפליקציה לאתר?',
        answer: 3,
        options: ['שניהם נכתבים בשפות תכנות שונות', 'אתר יכול להפתח רק על דפדפן', 'שניהם צריכים להבדק על ידי איש בדיקות', 'כל התשובות נכונות']
    },
    {
        title: 'מצאת תקלה במוצר. מפתח המוצר ניגש אליך וטען שלא מדובר בתקלה אלא חלק מתפעול תקין של המוצר. מה הכי נכון מבין המשפטים הבאים',
        answer: 1,
        options: ['אתעקש איתו שזו כן תקלה', 'אבדוק קודם אם באמת טעיתי ואז אחזור אליו', 'מדובר במפתח המוצר לכן בטוח שהוא צודק', 'אמחק את הבאג שהזנתי ואמשיך לעבוד']
    },
    {
        title: 'המצב הכי חשוב שכדאי שהמערכות בחברת חשמל יבדקו הוא',
        answer: 3,
        options: ['מזג האויר נוח', 'מזג האויר סוער וקר', 'מזג האויר חם מאד', 'בכל המצבים הנ"ל']
    },
    {
        title: 'במידה שאת/ה מנסה להפעיל אפליקציה בבית והיא לא עובדת את/ה',
        answer: 1,
        options: ['מתייאש/ת ומסיר/ה את האפליקציה', 'מנסה להפעיל אותה שוב בדרך אחרת ', 'לא עושה כלום ועובר/ת לאפליקציה הבאה ', 'מדווח/ת על האפליקציה ליצרנים ']
    },
    {
        title: 'תכונת האופי שהכי מאפיינת אותי מבין הבאות היא',
        answer: 0,
        options: ['יכולת למידה עצמית וירידה לפרטים ', 'חברותי וסתגלן', 'זריז ומהיר', 'סקרן ויסודי ']
    },
    ],
    ///
    digitalMarkting:[
        {
        title: '?מה זה קנבה',
        answer: 2,
        options: ['לא מכיר','בד ציור','אתר ליצירת גרפיקות','אתר לניהול מדיה']
    },
    {
        title: 'פוסט שיווקי בפייסבוק צריך להיות',
        answer: 0,
        options: ['מעניין','ארוך','קצר','ענייני']
    },
    {
        title: 'מה משותף לרילס שורטס וטיקטוק',
        answer: 1,
        options: ['כולם של אותה החברה','סרטונים קצרים','מדובר בסוג מדיה שונה לגמרי','סרטונים ארוכים']
    },
    {
        title: 'מה היא בינה מלאכותית',
        answer: 2,
        options: ['רובוט משחק','אתר לחיפוש כמו גוגל','מערכת מחשב חכמה','טכניקת ציור ואיור']
    },
    {
        title: '?AI מה ראשי התיבות',
        answer: 0,
        options: ['Artificial Intelligence','Artificial Insect','Abandon Intelligence','Authentic Intelligence']
    },
    {
        title: '?מה לא נכון מבין התשובות הבאות: באיזו רשת חברתית היית מתחיל בפרסום העסק שלך',
        answer: 0,
        options: ['הייתי מפרסם קודם כל בעיתון ואז מחליט','אם זה לבעלי עסקים אז בפייסבוק','אם זה לצעירים אז באינסטגרם או טיק טוק ','אם זה לקהל כמה שיותר רחב - אז בכל הרשתות אם זה אפשרי']
    },
    {
        title: '?לכמה שעות נשאר הסטורי לצפיה',
        answer: 1,
        options: ['12','24','36','48']
    },
    {
        title: ' "מהי הגדרת "ניהול מדיה חברתית',
        answer: 3,
        options: ['ניהול המכירות של הארגון באונליין','ניהול אנשים ברשתות החברתיות','ניהול וסידור תמונות ווידאו ','ניהול הפעילות המקוונת של ארגון ברשתות החברתיות']
    }
],

socialMedia:[
    {
    title: '?מה זה קנבה',
    answer: 2,
    options: ['לא מכיר','בד ציור','אתר ליצירת גרפיקות','אתר לניהול מדיה']
},
{
    title: 'פוסט שיווקי בפייסבוק צריך להיות',
    answer: 0,
    options: ['מעניין','ארוך','קצר','ענייני']
},
{
    title: 'מה משותף לרילס שורטס וטיקטוק',
    answer: 1,
    options: ['כולם של אותה החברה','סרטונים קצרים','מדובר בסוג מדיה שונה לגמרי','סרטונים ארוכים']
},
{
    title: 'מה היא בינה מלאכותית',
    answer: 2,
    options: ['רובוט משחק','אתר לחיפוש כמו גוגל','מערכת מחשב חכמה','טכניקת ציור ואיור']
},
{
    title: '?AI מה ראשי התיבות',
    answer: 0,
    options: ['Artificial Intelligence','Artificial Insect','Abandon Intelligence','Authentic Intelligence']
},
{
    title: '?מה לא נכון מבין התשובות הבאות: באיזו רשת חברתית היית מתחיל בפרסום העסק שלך',
    answer: 0,
    options: ['הייתי מפרסם קודם כל בעיתון ואז מחליט','אם זה לבעלי עסקים אז בפייסבוק','אם זה לצעירים אז באינסטגרם או טיק טוק ','אם זה לקהל כמה שיותר רחב - אז בכל הרשתות אם זה אפשרי']
},
{
    title: '?לכמה שעות נשאר הסטורי לצפיה',
    answer: 1,
    options: ['12','24','36','48']
},
{
    title: ' "מהי הגדרת "ניהול מדיה חברתית',
    answer: 3,
    options: ['ניהול המכירות של הארגון באונליין','ניהול אנשים ברשתות החברתיות','ניהול וסידור תמונות ווידאו ','ניהול הפעילות המקוונת של ארגון ברשתות החברתיות']
}
],


    ////
    fullstack: [{
        title: '5+8:2-1 מהי התשובה הנכונה לתרגיל',
        answer: 0,
        options: ['8', '5.5', '5', '9']
    },
    {
        title:
            'CSS is the language we use to style an HTML document.',
        answer: 1,
        options: ['CSS שפה שמשמשת לעיצוב מסמך ה HTML', 'HTMLהינה שפה שמשמשת לעיצוב מסמך ה CSS', 'שפת עיצוב למסמכים חשובים', 'HTML בתוך CSS לא ניתן להגדיר ']
    },
    {
        title: 'We use browser to?',
        answer: 3,
        options: ['Turn on the computer', 'Learn new project', 'Install software', 'Use the internet']
    },
    {
        title: '2X + 44 = 10 * (2+X)',
        answer: 1,
        options: ['x = 6', 'x = 3', 'x = 2', 'x = Error']
    },
    {
        title: '4 / 0.4',
        answer: 3,
        options: ['16', '1.6', '0.1', '10']
    },
    {
        title: 'משאית נוסעת במהירות של 81 קמ"ש, לאיזה מרחק תגיע אחרי 20 דקות',
        answer: 2,
        options: ['30KM', '20KM', '27KM', '40.5KM']
    },
    {
        title: 'If you multiply this number by any other number, the answer will always be the same. What number is this?',
        answer: 0,
        options: ['zero', 'one', 'None', 'two']
    },
    {
        title: 'אתה מנסה להריץ תוכנה שהתקנת פעם ראשונה והיא מחזירה הודעת שגיאה, מה תעשה',
        answer: 1,
        options: ['תמחק את התוכנה ותתקין שוב', 'תקרא את ההודעה ותנסה לתקן את הבעיה', 'ריסטרט למחשב ולהתקין מחדש את התוכנה', 'תחפש תוכנה אחרת לעבוד איתה']
    },
    {
        title: 'What is the next number? 3 12 39 120 ...',
        answer: 2,
        options: ['174', '159', '363', '300']
    },
    {
        title: 'JPG , GIF , PNG',
        answer: 0,
        options: ['סוגים של קבצי תמונה', 'סוגים של קבצי אודיו', 'חברות המשחקים הפופולריות ביותר', 'חברות כרטיסי המסך הפופולריות ביותר']
    }],


    //// new fulstack test
    fullstack_second_test:[
        {
            title: q2,
            answer: 1,
            options: [81,72,64,75]
        },
        {
            title: '?incorrect מה פירוש המילה',
            answer: 2,
            options: ['נכון','נכון מאוד','לא נכון','לא נכון מאוד']
        },
        {
            title: '?מה תפקיד המתכנת',
            answer: 0,
            options: ['לכתוב קוד','להנדס מחשבים','לעשות בדיקות מקיפות','להבין בתוכנה']
        },
        {
            title: 'אם שעה רגילה הינה 60 דקות ושעה אקדמאית היא 45 דקות, כמה שעות רגילות הינן 8 שעות אקדמאיות',
            answer: 1,
            options: ['5','6','7.5','8']
        },
        {
            title: ',תומר מסר קופסא עם עוגה לנועה'+
           'עוגה זהה נמסרה גם לאסתר.'+
           'מי בוודאות הביא את העוגה לאסתר?',
            answer: 3,
            options: ['תומר','נועה','המוכר בחנות','אי אפשר לדעת']
        },
        {
            title: q3,
            answer: 3,
            options: ['יש הבדלים בין מלבנים למעגלים','יש הבדל משולש לעיגול','יש הבדלים בין קוים למעגלים','יש הבדל בין קו למעגל']
        },
        {
            title: 'שמעת על טכנולוגיה הייטקית חדשה שפותחה. מה תעשה?',
            answer: 1,
            options: ['אבדוק בעיתונים','אחפש בגוגל','אשאל חברים אם שמעו על זה','לא אעשה כלום,זה לא נוגע אליי']
        },
        {
            title: '?כ50% מהאוכלוסיה סובלים מתופעות הקשורות למגפת הקורונה, 50% מתוכם קבלו חיסונים נגד קורונה, כמה אחוזים מהאוכלוסיה שסובלים מתופעות הקשורות למגפת הקורונה לא חוסנו',
            answer: 0,
            options: ['50%','75%','25%','100%']
        },
        {
            title: 'כדי להיות מתכנת טוב צריך',
            answer: 2,
            options: ['לעשות את שיעורי הבית מתי שיוצא','להיות נוכח ברוב השיעורים','להשקיע שעות בכתיבת קוד','להשתדל לקרוא כתבות הקשורות בהייטק']
        },
        {
            title: q1,
            answer: 0,
            options: ['9','5','7','2']
        },
    ],


    ///
    gaming: [{
        title: '5+8:2-1 מהי התשובה הנכונה לתרגיל',
        answer: 0,
        options: ['8', '5.5', '5', '9']
    },
    {
        title:
            'כיצד מחשבים היקף של עיגול',
        answer: 3,
        options: ['R/2+PI', '(R*R)/PI', '2*R', '2*Pi*R']
    },
    {
        title: 'What is C#?',
        answer: 0,
        options: ['Software language', 'Part of Office', 'Kind of Operation System', 'Graphics Card']
    },
    {
        title: '2X + 44 = 10 * (2+X)',
        answer: 1,
        options: ['x = 6', 'x = 3', 'x = 2', 'x = Error']
    },
    {
        title: '4 / 0.4',
        answer: 3,
        options: ['16', '1.6', '0.1', '10']
    },
    {
        title: 'משאית נוסעת במהירות של 81 קמ"ש, לאיזה מרחק תגיע אחרי 20 דקות',
        answer: 2,
        options: ['30KM', '20KM', '27KM', '40.5KM']
    },
    {
        title: 'If you multiply this number by any other number, the answer will always be the same. What number is this?',
        answer: 0,
        options: ['zero', 'one', 'None', 'two']
    },
    {
        title: 'אתה מנסה להריץ תוכנה שהתקנת פעם ראשונה והיא מחזירה הודעת שגיאה, מה תעשה',
        answer: 1,
        options: ['תמחק את התוכנה ותתקין שוב', 'תקרא את ההודעה ותנסה לתקן את הבעיה', 'ריסטרט למחשב ולהתקין מחדש את התוכנה', 'תחפש תוכנה אחרת לעבוד איתה']
    },
    {
        title: 'What is the next number? 3 12 39 120 ...',
        answer: 2,
        options: ['174', '159', '363', '300']
    },
    {
        title: 'JPG , GIF , PNG',
        answer: 0,
        options: ['סוגים של קבצי תמונה', 'סוגים של קבצי אודיו', 'חברות המשחקים הפופולריות ביותר', 'חברות כרטיסי המסך הפופולריות ביותר']
    }],

    //////
    cyber: [{
        title: '?מה ההבדל בין מחשב קצה/רגיל (ביתי, משרדי וכדומה) לבין מחשב מסוג שרת',
        answer: 0,
        options: ['מחשב שרת בדרך כלל יותר חזק במפרט \nהחומרה והביצועים, ומספק\n שירותים בזמן שמחשבי קצה צורכים ומקבלים שירותים',
         'מחשבי קצה יותר חזקים בביצועים \nבדרך כלל ממחשבי שרת \nומספקים שירותים שמחשבי השרת צורכים',
         'מחשבי קצה בדרך כלל משמשים לגיימינג',' NASA מחשבי שרת נמצאים רק בחברות כמו']
    },
    {
        title:
            '?מה תעשה כשהאינטרנט בבית לא פועל',
        answer: 3,
        options: ['תחליף את הציוד הישן בחדש','תתקשר לספקית האינטרנט','תנסה לפתור את הבעיה לבד',' תנסה לפתור את הבעיה בעצמך \nובמידה ותגיע למסקנה שהבעיה\n לא ברשת הביתית אז תתקשר לספק האינטרנט']
    },
    {
        title:'?איזה סוג מחשב תעדיף',
        answer: 2,
        options: ['מחשב חלש ועם ביצועים נמוכים','מחשב עם ביצועים מספקים \nשעונים על הצרכים העכשוויים','מחשב חזק שעונה על הצרכים העכשוויים\n אך פוטנציאלית יענה גם על צרכים נוספים בעתיד','העיקר שיהיה דפדפן וסוליטר']
    },
    {
        title: 'במידה ותרצה ללמוד נושא חדש, איפה תחפש עליו מידע',
        answer: 1,
        options: ['בספרייה הסמוכה לביתך', 'במנועי חיפוש כמו גוגל', 'בפורומים ובלוגים', 'בעיתונות']
    },
    {
        title: 'שניים עלו לקצה הארובה על גג בית, בצד דרום היה פיח שחור, בצד צפון תעלה שמובילה לתחתית עמוקה. במידה והאחד שעומד בצד צפון ימשוך את האדם אשר עומד בצד דרום, מה יקרה',
        answer: 3,
        options: ['האדם אשר בצד דרום יפול לפיח השחור', 'האדם אשר בצד דרום יפול לתעלה', 'שניהם יפלו לפיר השחור', 'שניהם יפלו לתעלה']
    },
    {
        title: '?knowing מה משמעות המילה ',
        answer: 2,
        options: ['אצילות עליונה', 'חכמה וידע מרובים.','ידיעה והבנה חוויתית על \nבסיס ניסיון אשר מביאה את האדם לידי חכמה','ידיעה ובנה שאינה חוויתית\n על בסיס למידה מספר או כל מקור דומה אחר']
    },
    {
        title: '?Reality מה פירוש המילה ',
        answer: 2,
        options: ['אמת','אמיתות העניין','מציאות','מציאות מדומה']
    },
    {
        title:'?server farm מה פירוש המילה',
        answer: 1,
        options: ['חוות מחשבי קצה','חוות שרתים','quantum מחשב מבוסס מעבדי ','מחשב נייד']
    },
    {
        title: '?Computer Screen monitor מהו ',
        answer: 0,
        options: ['מסך מחשב','מקלדת ועכבר','ניטור מסכי מחשב','ניטור יחידות קצה']
    },
    {
        title: ':בחר את ההסבר למשפט הבא____ The truth will come to light from behind the veil ',
        answer: 1,
        options: ['veil האמת תצא לאור מיישות שנקראת','מאחורי הפרגוד, האמת תצא לאור','matrixזה ההסבר על מסכי מציאות כמו ב','לא יודע']
    }],
    general: {
        test1: [{
            title: 'כיצד היית מדרג את רמת הקריאה וההבנה שלך באנגלית',
        },
        {
            title: 'עד כמה אתה טוב בפתירת שאלות מתמטיות (שאלות הגיון)',
        }
        ],
        test2: [
            {
                title: 'מעניין אותי לפרק מוצר ולדעת כיצד הוא עובד',
                match: ['fullstack']
            },
            {
                title: 'מעניין אותי שפות תכנות',
                match: ['fullstack']
            },
            {
                title: 'נתקלת בבעיה במחשב, חשוב לי להבין לעומק את מקור הבעיה',
                match: ['qa']
            },
            {
                title: 'הורדתי משחק לטלפון, יש בו תקלה קטנה בגרפיקה אבל המשחק עובד, אמשיך לשחק בו',
                match: ['qa']
            },
            {
                title: 'אני גיימר',
                match: ['gaming']
            },
            {
                title: 'נושא האקרים מאוד מעניין אותי',
                match: ['cyber']
            },
            {
                title: 'מעניין אותי לדעת איך האינטרנט עובד',
                match: ['cyber']
            },
        ]
    }
    

}